# HasBeltMeasurement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpacingRule..::..HasBeltMeasurement Property
SpacingRule Class See Also
---
True if the gridlines are not parallel due to surface curvature, and the BeltMeasurement property therefore applies.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HasBeltMeasurement { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasBeltMeasurement As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasBeltMeasurement {
	bool get ();
}
```

# See Also
SpacingRule Class
Autodesk.Revit.DB Namespace